# ReferenceableViewUtils Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ReferenceableViewUtils Members
ReferenceableViewUtils Class Methods See Also
---
The ReferenceableViewUtils type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ChangeReferencedView | Changes a particular reference view (such as a reference section or reference callout) to refer to a different View. |
| GetReferencedViewId | Gets the id of the view referenced by a reference view (such as a reference section or reference callout). |

# See Also
ReferenceableViewUtils Class
Autodesk.Revit.DB Namespace